Chapter 1 - How a Data Scientist Beat the Odds
Chapter 2 - A Data Science Framework
Chapter 3 - Step 1: Define the Problem and Step 2: Gather the Data
Chapter 4 - Step 3: Prepare Data for Consumption
Chapter 5 - The 4 C's of Data Cleaning: Correcting, Completing, Creating, and Converting
Chapter 6 - Step 4: Perform Exploratory Analysis with Statistics
Chapter 7 - Step 5: Model Data
Chapter 8 - Evaluate Model Performance
Chapter 9 - Tune Model with Hyper-Parameters
Chapter 10 - Tune Model with Feature Selection
Chapter 11 - Step 6: Validate and Implement
Chapter 12 - Conclusion and Step 7: Optimize and Strategize
Change Log
Credits

In [96]:
import pandas as pd

In [97]:
train=pd.read_csv('data/train.csv')

In [98]:
test=pd.read_csv('data/test.csv')

In [99]:
data_cleaner=[train,test]

In [100]:
print(train.info())
train.sample(10)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
711,712,0,1,"Klaber, Mr. Herman",male,NaN,0,0,113028,26.5500,C124,S
380,381,1,1,"Bidois, Miss. Rosalie",female,42.0,0,0,PC 17757,227.5250,NaN,C
449,450,1,1,"Peuchen, Major. Arthur Godfrey",male,52.0,0,0,113786,30.5000,C104,S
552,553,0,3,"O'Brien, Mr. Timothy",male,NaN,0,0,330979,7.8292,NaN,Q
537,538,1,1,"LeRoy, Miss. Bertha",female,30.0,0,0,PC 17761,106.4250,NaN,C
375,376,1,1,"Meyer, Mrs. Edgar Joseph (Leila Saks)",female,NaN,1,0,PC 17604,82.1708,NaN,C
180,181,0,3,"Sage, Miss. Constance Gladys",female,NaN,8,2,CA. 2343,69.5500,NaN,S
615,616,1,2,"Herman, Miss. Alice",female,24.0,1,2,220845,65.0000,NaN,S
617,618,0,3,"Lobb, Mrs. William Arthur (Cordelia K Stanlick)",female,26.0,1,0,A/5. 3336,16.1000,NaN,S
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S

In [101]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Lefebre, Miss. Ida",male,NaN,NaN,NaN,CA. 2343,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [102]:
train_null=train.isnull().sum()
train_null[train_null>0].sort_values(ascending=False)

Cabin       687
Age         177
Embarked      2
dtype: int64

In [103]:
#Clean data

In [104]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [105]:
train=train.drop(['PassengerId'],axis=1)

In [106]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [107]:
train=train.drop(['Ticket','Cabin'],axis=1)

In [108]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

In [109]:
train=train.drop(['Name'],axis=1)

In [110]:
train['Embarked']=train.Embarked.fillna('S')

In [111]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [112]:
train.Embarked.value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [113]:
train.Embarked[train['Embarked']=='S']=0
train.Embarked[train['Embarked']=='C']=1
train.Embarked[train['Embarked']=='Q']=2

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [114]:
train.Embarked.value_counts()

0    646
1    168
2     77
Name: Embarked, dtype: int64

In [115]:
train.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        0
1         1       1  female  38.0      1      0  71.2833        1
2         1       3  female  26.0      0      0   7.9250        0
3         1       1  female  35.0      1      0  53.1000        0
4         0       3    male  35.0      0      0   8.0500        0

In [116]:
train['Family']=train['SibSp']+train['Parch']

In [117]:
train.sample(30)

     Survived  Pclass     Sex    Age  SibSp  Parch      Fare Embarked  Family
68          1       3  female  17.00      4      2    7.9250        0       6
10          1       3  female   4.00      1      1   16.7000        0       2
777         1       3  female   5.00      0      0   12.4750        0       0
221         0       2    male  27.00      0      0   13.0000        0       0
219         0       2    male  30.00      0      0   10.5000        0       0
650         0       3    male    NaN      0      0    7.8958        0       0
322         1       2  female  30.00      0      0   12.3500        2       0
150         0       2    male  51.00      0      0   12.5250        0       0
94          0       3    male  59.00      0      0    7.2500        0       0
464         0       3    male    NaN      0      0    8.0500        0       0
449         1       1    male  52.00      0      0   30.5000        0       0
630         1       1    male  80.00      0      0   30.0000        0       0
862         1       1  female  48.00      0      0   25.9292        0       0
335         0       3    male    NaN      0      0    7.8958        0       0
478         0       3    male  22.00      0      0    7.5208        0       0
191         0       2    male  19.00      0      0   13.0000        0       0
624         0       3    male  21.00      0      0   16.1000        0       0
831         1       2    male   0.83      1      1   18.7500        0       2
268         1       1  female  58.00      0      1  153.4625        0       1
587         1       1    male  60.00      1      1   79.2000        1       2
297         0       1  female   2.00      1      2  151.5500        0       3
676         0       3    male  24.50      0      0    8.0500        0       0
798         0       3    male  30.00      0      0    7.2292        1       0
761         0       3    male  41.00      0      0    7.1250        0       0
485         0       3  female    NaN      3      1   25.4667        0       4
309         1       1  female  30.00      0      0   56.9292        1       0
413         0       2    male    NaN      0      0    0.0000        0       0
640         0       3    male  20.00      0      0    7.8542        0       0
581         1       1  female  39.00      1      1  110.8833        1       2
163         0       3    male  17.00      0      0    8.6625        0       0

In [118]:
train.Family[train['Family']>=1]=1

C:\Users\avaithil\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [119]:
train.sample(20)

     Survived  Pclass     Sex   Age  SibSp  Parch      Fare Embarked  Family
439         0       2    male  31.0      0      0   10.5000        0       0
884         0       3    male  25.0      0      0    7.0500        0       0
730         1       1  female  29.0      0      0  211.3375        0       0
725         0       3    male  20.0      0      0    8.6625        0       0
600         1       2  female  24.0      2      1   27.0000        0       1
479         1       3  female   2.0      0      1   12.2875        0       1
647         1       1    male  56.0      0      0   35.5000        1       0
544         0       1    male  50.0      1      0  106.4250        1       1
60          0       3    male  22.0      0      0    7.2292        1       0
510         1       3    male  29.0      0      0    7.7500        2       0
739         0       3    male   NaN      0      0    7.8958        0       0
718         0       3    male   NaN      0      0   15.5000        2       0
473         1       2  female  23.0      0      0   13.7917        1       0
475         0       1    male   NaN      0      0   52.0000        0       0
26          0       3    male   NaN      0      0    7.2250        1       0
559         1       3  female  36.0      1      0   17.4000        0       1
410         0       3    male   NaN      0      0    7.8958        0       0
294         0       3    male  24.0      0      0    7.8958        0       0
354         0       3    male   NaN      0      0    7.2250        1       0
334         1       1  female   NaN      1      0  133.6500        0       1

In [120]:
train=train.drop(['SibSp','Parch'],axis=1)

In [121]:
train.head()

   Survived  Pclass     Sex   Age     Fare Embarked  Family
0         0       3    male  22.0   7.2500        0       1
1         1       1  female  38.0  71.2833        1       1
2         1       3  female  26.0   7.9250        0       0
3         1       1  female  35.0  53.1000        0       1
4         0       3    male  35.0   8.0500        0       0

In [122]:
def get_person(passenger):
    age,sex=passenger
    return 'child' if age<16 else sex

In [123]:
train['person']=train[['Age','Sex']].apply(get_person,axis=1)

In [125]:
train.drop(['Sex'],axis=1,inplace=True)

In [126]:
train.head()

   Survived  Pclass   Age     Fare Embarked  Family  person
0         0       3  22.0   7.2500        0       1    male
1         1       1  38.0  71.2833        1       1  female
2         1       3  26.0   7.9250        0       0  female
3         1       1  35.0  53.1000        0       1  female
4         0       3  35.0   8.0500        0       0    male

In [ ]:
train.person[train['person']=='male']=0
train.person[train['person']=='female']=1